<details ><summary>apply for ruby-getting-started-terraform 2025-12-30 11:05:06 (UTC)</summary>
    <details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_instance_profile.bastion will be created
  + resource "aws_iam_instance_profile" "bastion" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ruby-getting-started-bastion-profile-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion-profile"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all    = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion-profile"
          + "Project"     = "ruby-getting-started"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.bastion will be created
  + resource "aws_iam_role" "bastion" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ruby-getting-started-bastion-role-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion-role"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion-role"
          + "Project"     = "ruby-getting-started"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.bastion_ssm will be created
  + resource "aws_iam_role_policy_attachment" "bastion_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-0a85e8e68d29c380f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-09e6407527e030f92"
      + tags                                 = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion"
          + "Project"     = "ruby-getting-started"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp3"
        }
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Security group for bastion host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/16",
                ]
              + description      = "Allow all outbound traffic within VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ruby-getting-started-bastion-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion-sg"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion-sg"
          + "Project"     = "ruby-getting-started"
        }
      + vpc_id                 = "vpc-08f9a71b86f4ba586"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
aws_iam_role.bastion: Creating...
aws_security_group.bastion: Creating...
aws_iam_role.bastion: Creation complete after 1s [id=ruby-getting-started-bastion-role-20251230110538383600000001]
aws_iam_role_policy_attachment.bastion_ssm: Creating...
aws_iam_instance_profile.bastion: Creating...
aws_iam_role_policy_attachment.bastion_ssm: Creation complete after 0s [id=ruby-getting-started-bastion-role-20251230110538383600000001-20251230110538667100000004]
aws_iam_instance_profile.bastion: Creation complete after 0s [id=ruby-getting-started-bastion-profile-20251230110538585500000003]
aws_security_group.bastion: Creation complete after 5s [id=sg-07efc7e12d325e692]
aws_instance.bastion: Creating...

```
</details>

<details ><summary>Error during applying.</summary>
  exit status 1
</details>

</details>